app/helpers/sessions_helper.rb

UPDATE "users" SET "updated_at" = $1, "remember_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-05-24 15:14:22.644736"], ["remember_token", "af8915fa8240ed01be925cd0010209f64c187eb3"], ["id", 2]]
---
	def sign_in(user)
		remember_token = User.new_remember_token
		cookies.permanent[:remember_token]=remember_token
		user.update_attribute(:remember_token,
			User.encrypt(remember_token))

SELECT "users".* FROM "users" WHERE "users"."remember_token" = $1 LIMIT $2  [["remember_token", "da39a3ee5e6b4b0d3255bfef95601890afd80709"], ["LIMIT", 1]]
---
	def current_user
		remember_token = User.encrypt(cookies[:remember_token])
		@current_user ||= User.find_by(remember_token: remember_token)

UPDATE "users" SET "updated_at" = $1, "remember_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2023-05-24 15:20:32.819851"], ["remember_token", "cbc05f31bee5dfa54896f2eb1ac55a83fb33ef0e"], ["id", 2]]
---
	def sign_out
		unless  current_user.blank?
			current_user.update_attribute(:remember_token,
				User.encrypt(User.new_remember_token))