app/controllers/sessions_controller.rb

  def create
    unless params[:session].blank?
      user = User.find_by(email: params[:session][:email].downcase)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@admin.ru"], ["LIMIT", 1]]