app/controllers/work_controller.rb

SELECT COUNT(*) FROM "images"
SELECT COUNT(*) FROM "values"
SELECT "themes"."name" FROM "themes"
---
  def index
    @images_count = Image.all.count
    # @selected_theme = "Select theme to leave your answer"
    @selected_theme = t(:def_select_theme)
    @selected_image_name = t(:default_image)
    @values_qty = Value.all.count
    @current_locale = I18n.locale
    @themes = Theme.all.pluck(:name)

SELECT "themes"."name" FROM "themes"
---
  def choose_theme
    @themes = Theme.all.pluck(:name)

SELECT COUNT(*) FROM "values"
---
  def display_theme
    logger.info "In work#display_theme"
    @image_data = {}
    I18n.locale = session[:current_locale]

    current_user_id = current_user.id
    if params[:theme] == "---" #.blank?
      theme = "Select theme to leave your answer"
      theme_id = 1
      values_qty = Value.all.count.round

SELECT "images".* FROM "images" WHERE "images"."theme_id" = $1 ORDER BY ave_value DESC LIMIT $2  [["theme_id", nil], ["LIMIT", 0]]
SELECT COUNT(*) FROM "images" WHERE "images"."theme_id" = $1  [["theme_id", nil]]
---
  def results_list
    @selected_theme_id = session[:selected_theme_id]
    res_composite_diag = Image.where(theme_id: @selected_theme_id).order("ave_value DESC")
    composite_results_size = res_composite_diag.size
    @composite_results = res_composite_diag.take(composite_results_size)