app/models/image.rb

UPDATE "images" SET "ave_value" = $1, "updated_at" = $2 WHERE "images"."id" = $3  [["ave_value", 50.0], ["updated_at", "2023-06-01 07:52:21.138857"], ["id", 1]]
---
	def self.update_ave_value(image_id, ave_value)
		image = find(image_id)
		image.update(ave_value: ave_value)

SELECT COUNT(*) FROM "values"
---
	def self.show_valued_image(new_value_data)
		image_id = new_value_data[:image_id]
		theme_id = new_value_data[:theme_id]
		current_user_id = new_value_data[:user_id]
		user_valued, value = Value.user_valued_exists(current_user_id, image_id) # 1/0 ?
		values_qty = Value.all.count.round

INSERT INTO "values" ("user_id", "image_id", "value", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["image_id", 1], ["value", 50], ["created_at", "2023-06-01 07:52:21.061039"], ["updated_at", "2023-06-01 07:52:21.061039"]]
---
	def self.value_and_update(new_value_data)
		image_id = new_value_data[:image_id]
		Value.create(new_value_data)