app/models/value.rb

	def self.calc_average_value(image_id)
		values_arr = self.where(image_id: image_id).pluck(:value)
---
SELECT "values"."value" FROM "values" WHERE "values"."image_id" = $1  [["image_id", 1]]

	def self.user_valued_exists(current_user_id, image_id)
		value_image = user_valued_image(current_user_id, image_id)
		if value_image.blank?
---
SELECT "values".* FROM "values" WHERE "values"."user_id" = $1 AND "values"."image_id" = $2  [["user_id", 1], ["image_id", 1]]