app/controllers/concerns/work_image.rb

	def show_image(theme_id, image_index)
		theme_images = Image.theme_images(theme_id)

		current_user_id = current_user.id
		logger.info "In show_image: current_user_id = #{current_user_id.inspect} "

		one_image_attr = theme_images[image_index].attributes
		logger.info "In show_image: one_image_attr = #{one_image_attr.inspect} "
		image_id = one_image_attr["id"]
		logger.info "In show_image: image_id = #{image_id.inspect} "

		user_valued, value = Value.user_valued_exists(current_user_id, image_id)
		logger.info "In show_image: user_valued = #{user_valued.inspect} "

		values_qty = Value.all.count.round
---
SELECT COUNT(*) FROM "values"